Управление_по_целям_и_KPI/src/Catalogs/KPI_ГрафикиРабот/KPI_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_ГрафикиРабот</name>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>Number</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочихЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаГрафика</name>
    <type>
      <types>CatalogRef.KPI_ФормулыГрафиков</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеГрафика</name>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов12</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов13</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов14</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов15</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов16</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов17</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов19</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов20</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов21</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов22</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов23</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов24</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов25</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов26</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов27</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов28</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов29</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов30</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов31</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня1</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня2</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня3</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня4</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня5</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня6</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня7</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня8</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня9</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня10</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня11</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня12</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня13</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня14</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня15</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня16</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня17</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня18</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня19</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня20</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня21</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня22</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня23</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня24</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня25</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня26</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня27</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня28</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня29</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня30</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня31</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_ГрафикиРабот/KPI_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_ГрафикиРабот</name>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.KPI_ВидыДнейГрафика</types>
    </type>
  </resources>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.KPI_ГрафикиРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Enums/KPI_ВидыДнейГрафика/KPI_ВидыДнейГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>KPI_ВидыДнейГрафика</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
  </enumValues>
  <enumValues>
    <name>Выходной</name>
  </enumValues>
</mdclass:Enum>

Управление_по_целям_и_KPI/src/Catalogs/KPI_ГрафикиРабот/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Перем ГодЧисло, ПК;

&НаКлиенте
Функция РезультатПодтверждения()
	
	Ответ = Вопрос("Информация о рабочих часах в табличной части будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, , , "Внимание");
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Элементы.СтраницыПараметровЗаполненияГрафика.ТекущаяСтраница = Элементы.СтраницаПроизводственныйКалендарь 
		И Не ЗначениеЗаполнено(Объект.ПроизводственныйКалендарь) Тогда
		Сообщить("Не выбран производственный календарь");
		Возврат;
	ИначеЕсли Элементы.СтраницыПараметровЗаполненияГрафика.ТекущаяСтраница = Элементы.СтраницыПараметровЗаполненияГрафика 
		И Не ЗначениеЗаполнено(Объект.ФормулаГрафика) Тогда
		Сообщить("Не выбран производственный календарь");
		Возврат;
	КонецЕсли;
	
	Если РезультатПодтверждения() Тогда
		ЗаполнитьДанныеГрафика();
	Иначе 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеГрафика()
	
	График = РеквизитФормыВЗначение("Объект");
	График.ЗаполнитьДанныеГрафика(ЭтаФорма.ЗаполнитьГрафикНачалоПериода);
	ЗначениеВРеквизитФормы(График,"Объект");
	РаскраситьТабличнуюЧасть();
		
КонецПроцедуры

&НаСервере
Процедура РаскраситьТабличнуюЧасть()
		
	УсловноеОформление.Элементы.Очистить();
	Выходной        = Перечисления.KPI_ВидыДнейГрафика.Выходной;
	Праздник        = Перечисления.KPI_ВидыДнейГрафика.Праздник;
	Предпраздничный = Перечисления.KPI_ВидыДнейГрафика.Предпраздничный;
	Для Каждого Стр из Объект.ДанныеГрафика Цикл
		
		ЭлементУсловногоОформленияВыходной = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформленияВыходной.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
		ЭлементУсловногоОформленияВыходной.Использование = Истина;
		
		ЭлементУсловногоОформленияПраздник = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформленияПраздник.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Розовый);
		ЭлементУсловногоОформленияПраздник.Использование = Истина;
		
		ЭлементУсловногоОформленияПредпраздничный = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформленияПредпраздничный.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Белый);
		ЭлементУсловногоОформленияПредпраздничный.Использование = Истина;
		
		
		
		ЭлементОтбораВыходной = ЭлементУсловногоОформленияВыходной.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораВыходной.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДанныеГрафика.Месяц");
		ЭлементОтбораВыходной.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораВыходной.ПравоеЗначение = НачалоМесяца(Стр.Месяц);
		ЭлементОтбораВыходной.Использование = Истина;
		
		ЭлементОтбораПраздник = ЭлементУсловногоОформленияПраздник.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораПраздник.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДанныеГрафика.Месяц");
		ЭлементОтбораПраздник.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораПраздник.ПравоеЗначение = НачалоМесяца(Стр.Месяц);
		ЭлементОтбораПраздник.Использование = Истина;
		
		ЭлементОтбораПредпраздничный = ЭлементУсловногоОформленияПредпраздничный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораПредпраздничный.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДанныеГрафика.Месяц");
		ЭлементОтбораПредпраздничный.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораПредпраздничный.ПравоеЗначение = НачалоМесяца(Стр.Месяц);
		ЭлементОтбораПредпраздничный.Использование = Истина;
		
		
		СтрокаМесяц = Объект.ДанныеГрафика.Получить(Месяц(Стр.Месяц)-1);
		Для НомерДня = 1 ПО 31 Цикл
			
			Если СтрокаМесяц["ВидДня"+НомерДня] = Выходной Тогда  
				ОформляемоеПолеВыходной = ЭлементУсловногоОформленияВыходной.Поля.Элементы.Добавить();
				ОформляемоеПолеВыходной.Поле = Новый ПолеКомпоновкиДанных("ДанныеГрафикаЧасов"+НомерДня);
				ОформляемоеПолеВыходной.Использование = Истина;
			ИначеЕсли СтрокаМесяц["ВидДня"+НомерДня] = Праздник Тогда 
				ОформляемоеПолеПраздник = ЭлементУсловногоОформленияПраздник.Поля.Элементы.Добавить();
				ОформляемоеПолеПраздник.Поле = Новый ПолеКомпоновкиДанных("ДанныеГрафикаЧасов"+НомерДня);
				ОформляемоеПолеПраздник.Использование = Истина;
			ИначеЕсли СтрокаМесяц["ВидДня"+НомерДня] = Предпраздничный Тогда 
				ОформляемоеПолеПредпраздничный = ЭлементУсловногоОформленияПредпраздничный.Поля.Элементы.Добавить();
				ОформляемоеПолеПредпраздничный.Поле = Новый ПолеКомпоновкиДанных("ДанныеГрафикаЧасов"+НомерДня);
				ОформляемоеПолеПредпраздничный.Использование = Истина;	
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеГрафикаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеГрафикаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ДанныеГрафика.Количество() = 0 Тогда
		Объект.Год = Год(ТекущаяДата());
		ПерезаполнитьСтрокиМесяцев(Объект.Год);
	КонецЕсли;
	
	Элементы.ПроизводственныйКалендарь.ОграничениеТипа.Типы().Очистить();
	Если KPI_ПереопределяемыйСервер.ИнтегрированныйФункционал() Тогда
		ТипПроизводственогоКалендаря = Новый ОписаниеТипов(KPI_ПереопределяемыйСервер.ТипСправочникаПроизводственныйКалендарь());
		Элементы.ПроизводственныйКалендарь.ОграничениеТипа = ТипПроизводственогоКалендаря;
		Элементы.СтраницыПараметровЗаполненияГрафика.ТекущаяСтраница = Элементы.СтраницаПроизводственныйКалендарь;
	Иначе
		Элементы.СтраницыПараметровЗаполненияГрафика.ТекущаяСтраница = Элементы.СтраницаПараметрыГрафика;
	КонецЕсли;
	
	РаскраситьТабличнуюЧасть();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьСтрокиМесяцев(Год)
	
	Объект.ДанныеГрафика.Очистить();
	
	Для м = 1 По 12 Цикл
		НовСтр = Объект.ДанныеГрафика.Добавить();
		НовСтр.Месяц = Дата(Объект.Год, м, 1);
	КонецЦикла;
	
	РаскраситьТабличнуюЧасть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииГода()
	
	ГодЧисло = Объект.Год;
	
	Если РезультатПодтверждения() Тогда
		Объект.Год = Число(ЭтаФорма.Элементы.Год.ТекстРедактирования);
		ПерезаполнитьСтрокиМесяцев(Объект.Год);
	Иначе 
		Объект.Год = ГодЧисло;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ГодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ПриИзмененииГода();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеГрафикаПередНачаломИзменения(Элемент, Отказ)
	
	Попытка
		ТестДата = Дата(Объект.Год, Месяц(Элемент.ТекущиеДанные.Месяц), Число(Элемент.ТекущийЭлемент.Заголовок));
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеГрафикаПриИзменении(Элемент)
	сумм = 0;
	колво = 0;
	
	Для д = 1 По 31 Цикл
		ТекЧасов = Элемент.ТекущиеДанные["Часов" + д];
		
		сумм = сумм + ТекЧасов;
		
		Если ТекЧасов > 0 Тогда
			колво = колво + 1;
		КонецЕсли;
	КонецЦикла;
	
	Элемент.ТекущиеДанные.ИтогоЧасов = сумм;
	Элемент.ТекущиеДанные.ИтогоДней = колво;
КонецПроцедуры

&НаКлиенте
Процедура ПроизводственныйКалендарьПриИзменении(Элемент)
	
	Если РезультатПодтверждения() Тогда
		ПерезаполнитьСтрокиМесяцев(Объект.Год);
		ПК = Объект.ПроизводственныйКалендарь;
	Иначе
		Объект.ПроизводственныйКалендарь = ПК;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ГодЧисло = Объект.Год;
	ПК = Объект.ПроизводственныйКалендарь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводственныйКалендарьОткрытие(Элемент, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.ПроизводственныйКалендарь) = Тип("Число") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыОткрытия = Новый Структура("Год",Объект.ПроизводственныйКалендарь);
		ОткрытьФорму("РегистрСведений.KPI_ГрафикиРабот.Форма.ПраздничныеДни",ПараметрыОткрытия);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДанныеГрафикаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДанныеГрафика.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаВидДня = "ВидДня" + СтрЗаменить(Поле.Имя,"ДанныеГрафикаЧасов","");
	ТекущийВидДня = ТекущиеДанные[ИмяРеквизитаВидДня];	
	
	ВидыДней = ВидыДнейГрафика();
	ВыбранныйВидДня = ВидыДней.ВыбратьЭлемент("Виды дней графика",ВидыДней.НайтиПоЗначению(ТекущийВидДня));
	Если НЕ ВыбранныйВидДня = Неопределено Тогда
		 ТекущиеДанные[ИмяРеквизитаВидДня] = ВыбранныйВидДня.Значение;
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидыДнейГрафика()
	
	ВидыДней = Новый СписокЗначений;
	ВидыДней.Добавить(Перечисления.KPI_ВидыДнейГрафика.Выходной,"Выходной");
	ВидыДней.Добавить(Перечисления.KPI_ВидыДнейГрафика.Праздник,"Праздничный");
	ВидыДней.Добавить(Перечисления.KPI_ВидыДнейГрафика.Предпраздничный,"Предпраздничный");
	ВидыДней.Добавить(Перечисления.KPI_ВидыДнейГрафика.Рабочий,"Рабочий");	
	
	Возврат ВидыДней;
	
КонецФункции
